# Taps
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "d12frosted/emacs-plus"

# General apps
brew "mas" # Mac App Store command-line interface -- https://github.com/mas-cli/mas
brew "syncthing" # Open source continuous file synchronization application -- https://syncthing.net/
# General casks
cask "appcleaner" # Application uninstaller -- https://freemacsoft.net/appcleaner/
cask "bazecor" # Graphical configurator for Dygma keyboards -- https://dygma.com/pages/programmable-split-keyboard
#cask "blockblock" # Monitors common persistence locations -- https://objective-see.com/products/blockblock.html
cask "discord" # Voice and text chat software -- https://discord.com/
cask "figma" # Collaborative team software -- https://www.figma.com/
cask "gpg-suite" # Tools to protect your emails and files -- https://gpgtools.org/
cask "hammerspoon" # Desktop automation application -- https://www.hammerspoon.org/
cask "homerow" # Keyboard shortcuts for every button on your screen -- https://www.homerow.app/
cask "jellyfin-media-player" # Jellyfin desktop client -- https://jellyfin.org/
#cask "kap" # Open-source screen recorder built with web technology -- https://getkap.co/
cask "knockknock" # Tool to show what is persistently installed on the computer -- https://objective-see.com/products/knockknock.html
cask "localsend" # Open-source cross-platform alternative to AirDrop -- https://localsend.org/
cask "monitorcontrol" # Tool to control external monitor brightness & volume -- https://github.com/MonitorControl/MonitorControl
cask "mouseless" # Mouse control with the keyboard -- https://mouseless.click/
cask "netnewswire" # Free and open-source RSS reader -- https://netnewswire.com/
cask "onyx" # Verify system files structure, run miscellaneous maintenance and more -- https://www.titanium-software.fr/en/onyx.html
cask "rectangle" # Move and resize windows using keyboard shortcuts or snap areas -- https://rectangleapp.com/
cask "the-unarchiver" # Unpacks archive files -- https://theunarchiver.com/
cask "transmission" # Open-source BitTorrent client -- https://transmissionbt.com/
cask "whatsyoursign" # Shows a files cryptographic signing information -- https://objective-see.com/products/whatsyoursign.html
cask "zoom" # Video communication and virtual meeting platform -- https://www.zoom.us/
cask "zotero" # Collect, organize, cite, and share research sources -- https://www.zotero.org/
# General MAS apps
mas "Actions", id: 1_586_435_171 # https://sindresorhus.com/actions
mas "Bitwarden", id: 1_137_397_744 # https://bitwarden.com/
mas "Camera Preview", id: 1_632_827_132 # https://sindresorhus.com/camera-preview
mas "Color Picker", id: 1_545_870_783 # https://sindresorhus.com/system-color-picker
mas "Pandan", id: 1_569_600_264 # https://sindresorhus.com/pandan
mas "Textual IRC Client", id: 1_262_957_439 # https://www.codeux.com/textual/
#mas "Vimari", id: 1_480_933_944 # https://televator.net/vimari/

# Fonts
cask "font-cascadia-code" # Monospaced font that includes programming ligatures -- https://github.com/microsoft/cascadia-code
cask "font-cascadia-code-nf" # Version of Cascadia Code with embedded Nerd Fonts symbols -- https://github.com/microsoft/cascadia-code
cask "font-cascadia-code-pl" # Version of Cascadia Code with embedded Powerline symbols -- https://github.com/microsoft/cascadia-code
cask "font-cascadia-mono" # Version of Cascadia Code without ligatures -- https://github.com/microsoft/cascadia-code
cask "font-cascadia-mono-nf" # Version of Cascadia Code without ligatures and with embedded Nerd Fonts symbols -- https://github.com/microsoft/cascadia-code
cask "font-cascadia-mono-pl" # Version of Cascadia Code without ligatures and with embedded Powerline symbols -- https://github.com/microsoft/cascadia-code
cask "font-dejavu" # Monospaced font based on Bitstream Vera -- https://sourceforge.net/projects/dejavu/
cask "font-fira-code" # Monospaced font with programming ligatures -- https://github.com/tonsky/FiraCode
cask "font-fira-sans" # Font used in Firefox OS -- https://mozilla.github.io/Fira/
cask "font-firago" # Successor to Fira Sans -- https://bboxtype.com/typefaces/FiraGO/
cask "font-ibm-plex" # Corporate typeface for IBM -- https://github.com/IBM/plex
cask "font-inconsolata" # Humanist lineal monospaced font -- https://fonts.google.com/specimen/Inconsolata
cask "font-iosevka" # Sans-serif, slab-serif, monospace and quasi‑proportional typeface family -- https://github.com/be5invis/Iosevka
cask "font-jetbrains-mono" # Typeface made for developers -- https://www.jetbrains.com/lp/mono
cask "font-juliamono" # Monospaced typeface designed for programming in Julia -- https://github.com/cormullion/juliamono
cask "font-roboto" # Font with a mechanical skeleton and the forms are largely geometric -- https://fonts.google.com/specimen/Roboto
cask "font-roboto-condensed" # Condensed variant of Roboto -- https://fonts.google.com/specimen/Roboto+Condensed
cask "font-roboto-flex" # Variable successor to Roboto -- https://fonts.google.com/specimen/Roboto+Condensed
cask "font-roboto-mono" # Monospaced variant of Roboto -- https://fonts.google.com/specimen/Roboto+Mono
cask "font-roboto-slab" # Slab variant of Roboto -- https://fonts.google.com/specimen/Roboto+Slab
cask "font-sf-mono" # Monospaced variant of "San Francisco" by Apple -- https://developer.apple.com/fonts/
cask "font-sf-pro" # Sans-serif variant of "San Francisco" by Apple -- https://developer.apple.com/fonts/
cask "font-source-code-pro" # Monospaced companion to Source Sans -- https://fonts.google.com/specimen/Source+Sans+Pro
cask "font-source-sans-3" # Sans-serif typeface intended to work well in user interfaces -- https://fonts.google.com/specimen/Source+Sans+3
cask "font-source-serif-4" # Serif companion to Source Sans -- https://fonts.google.com/specimen/Source+Serif+4

# Browser apps
brew "emscripten" # LLVM bytecode to JavaScript compiler -- https://emscripten.org/
brew "mozjpeg" # Improved JPEG encoder -- https://github.com/mozilla/mozjpeg
brew "jpeg-xl" # New file format for still image compression -- https://jpeg.org/jpegxl/
brew "wabt" # Web Assembly Binary Toolkit -- https://github.com/WebAssembly/wabt
brew "webp" # Image format providing lossless and lossy compression for web images -- https://developers.google.com/speed/webp/
# Browser casks
cask "charles" # Web debugging Proxy application -- https://www.charlesproxy.com/
cask "firefox" # Web browser -- https://www.mozilla.org/firefox/
cask "google-chrome" # Web browser -- https://www.google.com/chrome/
cask "google-chrome@canary" # Web browser -- https://www.google.com/chrome/canary/
cask "imageoptim" # Tool to optimise images to a smaller size -- https://imageoptim.com/mac
#cask "safari-technology-preview" # Web browser -- https://developer.apple.com/safari/resources/

# Shell apps
brew "bash" # Bourne-Again SHell, a UNIX command interpreter -- https://www.gnu.org/software/bash/
brew "bash-completion" # Programmable completion for Bash -- https://salsa.debian.org/debian/bash-completion
brew "shellcheck" # Static analysis and lint tool, for (ba)sh scripts -- https://www.shellcheck.net/
brew "shfmt" # Autoformat shell script source code -- https://github.com/mvdan/sh

# Terminal casks
cask "alacritty" # GPU-accelerated terminal emulator -- https://github.com/alacritty/alacritty
cask "ghostty" # Terminal emulator that uses platform-native UI and GPU acceleration -- https://ghostty.org/
#cask "iterm2" # Terminal emulator as alternative to Apple's Terminal app -- https://www.iterm2.com/
cask "kitty" # GPU-based terminal emulator -- https://github.com/kovidgoyal/kitty
cask "wezterm" # GPU-accelerated cross-platform terminal emulator and multiplexer -- https://wezfurlong.org/wezterm/

# Text editing apps
brew "emacs-plus@30", # GNU Emacs text editor -- https://www.gnu.org/software/emacs/
  args: ["--with-native-comp", "--with-imagemagick", "--with-elrumo2-icon"]
brew "helix" # Post-modern modal text editor -- https://helix-editor.com/
brew "macvim" # GUI for Vim, made for macOS -- https://github.com/macvim-dev/macvim
brew "neovim" # Ambitious Vim-fork focused on extensibility and agility -- https://neovim.io/
# Text editing casks
cask "neovide" # Neovim client -- https://github.com/neovide/neovide
cask "visual-studio-code" # Open-source code editor -- https://code.visualstudio.com/

# Audio apps
brew "flac" # Free lossless audio codec -- https://xiph.org/flac/
brew "lame" # High quality MPEG Audio Layer III (MP3) encoder -- https://lame.sourceforge.io/
# Audio casks
cask "foobar2000" # Audio player -- https://www.foobar2000.org/mac
cask "musicbrainz-picard" # Music tagger -- https://picard.musicbrainz.org/

# Image apps
brew "exiftool" # Perl lib for reading and writing EXIF metadata -- https://exiftool.org/
brew "graphicsmagick" # Image processing tools collection -- http://www.graphicsmagick.org/
brew "imagemagick" # Tools and libraries to manipulate images in many formats -- https://imagemagick.org/index.php
# Image casks
cask "inkscape" # Vector graphics editor -- https://inkscape.org/
cask "krita" # Free and open-source painting and sketching program -- https://krita.org/

# Video apps
brew "ffmpeg" # Play, record, convert, and stream audio and video -- https://ffmpeg.org/
# Video casks
cask "handbrake" # Open-source video transcoder -- https://handbrake.fr/
cask "vlc" # Multimedia player -- https://www.videolan.org/vlc/
# Video MAS apps
mas "DaVinci Resolve", id: 571_213_070 # https://www.blackmagicdesign.com/products/davinciresolve

# Gaming casks
cask "epic-games" # Launcher for *Epic Games* games -- https://www.epicgames.com/
cask "steam" # Video game digital distribution service -- https://store.steampowered.com/about/

# Dev apps
brew "autoconf" # Automatic configure script builder -- https://www.gnu.org/software/autoconf
brew "automake" # Tool for generating GNU Standards-compliant Makefiles -- https://www.gnu.org/software/automake/
brew "bat" # Clone of cat with syntax highlighting and Git integration -- https://github.com/sharkdp/bat
brew "bottom" # Yet another cross-platform graphical process/system monitor -- https://clementtsang.github.io/bottom/
#brew "broot" # New way to see and navigate directory trees -- https://dystroy.org/broot/
brew "brotli" # Generic-purpose lossless compression algorithm by Google -- https://github.com/google/brotli
brew "btop" # Resource monitor. C++ version and continuation of bashtop and bpytop -- https://github.com/aristocratos/btop
brew "cmake" # Cross-platform make -- https://www.cmake.org/
brew "coreutils" # GNU File, Shell, and Text utilities -- https://www.gnu.org/software/coreutils
brew "ctop" # Top-like interface for container metrics -- https://bcicen.github.io/ctop/
brew "curl" # Get a file from an HTTP, HTTPS or FTP server -- https://curl.se
brew "dos2unix" # Convert text between DOS, UNIX, and Mac formats -- https://waterlan.home.xs4all.nl/dos2unix.html
brew "dust" # More intuitive version of du in rust -- https://github.com/bootandy/dust
brew "entr" # Run arbitrary commands when files change -- https://eradman.com/entrproject/
brew "fastfetch" # Like neofetch, but much faster because written mostly in C -- https://github.com/fastfetch-cli/fastfetch
brew "fd" # Simple, fast and user-friendly alternative to find -- https://github.com/sharkdp/fd
brew "figlet" # Banner-like program prints strings as ASCII art -- http://www.figlet.org/
brew "fzf" # Command-line fuzzy finder written in Go -- https://github.com/junegunn/fzf
brew "gcc" # GNU compiler collection -- https://gcc.gnu.org/
brew "gdu" # Disk usage analyzer with console interface written in Go -- https://github.com/dundee/gdu
brew "git" # Distributed revision control system -- https://git-scm.com/
brew "graphviz" # Graph visualization software from AT&T and Bell Labs -- https://graphviz.org/
brew "grep" # GNU grep, egrep and fgrep -- https://www.gnu.org/software/grep/
brew "haskell-stack" # Cross-platform program for developing Haskell projects -- https://haskellstack.org/
brew "hexyl" # Command-line hex viewer -- https://github.com/sharkdp/hexyl
brew "hugo" # Configurable static site generator -- https://gohugo.io/
brew "hyperfine" # Command-line benchmarking tool -- https://github.com/sharkdp/hyperfine
brew "jq" # Lightweight and flexible command-line JSON processor -- https://jqlang.github.io/jq/
brew "lazygit" # Simple terminal UI for git commands -- https://github.com/jesseduffield/lazygit
brew "llvm" # Next-gen compiler infrastructure -- https://llvm.org/
brew "lnav" # Curses-based tool for viewing and analyzing log files -- https://lnav.org/
brew "lolcat" # Rainbows and unicorns in your console! -- https://github.com/busyloop/lolcat
brew "lsd" # Clone of ls with colorful output, file type icons, and more -- https://github.com/lsd-rs/lsd
brew "make" # Utility for directing compilation -- https://www.gnu.org/software/make/
brew "mise" # Polyglot runtime manager -- https://mise.jdx.dev/
brew "nasm" # Netwide Assembler (NASM) is an 80x86 assembler -- https://www.nasm.us/
brew "ncdu" # NCurses Disk Usage -- https://dev.yorhel.nl/ncdu
brew "netcat" # Utility for managing network connections -- https://netcat.sourceforge.net/
brew "nmap" # Port scanning utility for large networks -- https://nmap.org/
brew "nnn" # Tiny, lightning fast, feature-packed file manager -- https://github.com/jarun/nnn
brew "no-more-secrets" # Recreates the SETEC ASTRONOMY effect from 'Sneakers' -- https://github.com/bartobri/no-more-secrets
brew "ollama" # Create, run, and share large language models -- https://ollama.com/
brew "openssl" # Cryptography and SSL/TLS Toolkit -- https://openssl.org/
brew "pandoc" # Swiss-army knife of markup format conversion -- https://pandoc.org/
brew "parallel" # Shell command parallelization utility -- https://savannah.gnu.org/projects/parallel/
brew "pkg-config" # Manage compile and link flags for libraries -- https://freedesktop.org/wiki/Software/pkg-config/
brew "procs" # Modern replacement for ps written by Rust -- https://github.com/dalance/procs
brew "qrencode" # QR Code generation -- https://fukuchi.org/works/qrencode/index.html.en
brew "readline" # Library for command-line editing -- https://tiswww.case.edu/php/chet/readline/rltop.html
brew "rename" # Perl-powered file rename script with many helpful built-ins -- http://plasmasturm.org/code/rename
brew "ripgrep" # Search tool like grep and The Silver Searcher -- https://github.com/BurntSushi/ripgrep
brew "sqlite" # Command-line interface for SQLite -- https://sqlite.org/index.html
brew "starship" # Cross-shell prompt for astronauts -- https://starship.rs
brew "telnet" # User interface to the TELNET protocol -- https://opensource.apple.com/
brew "tmux" # Terminal multiplexer -- https://tmux.github.io/
brew "tokei" # Program that allows you to count code, quickly -- https://github.com/XAMPPRocky/tokei
brew "tree" # Display directories as trees (with optional color/HTML output) -- https://oldmanprogrammer.net/source.php?dir=projects/tree
brew "tree-sitter" # Parser generator tool and incremental parsing library -- https://tree-sitter.github.io/
brew "utm" # Virtual machines UI using QEMU -- https://mac.getutm.app/
brew "watchman" # Watch files and take action when they change -- https://github.com/facebook/watchman
brew "wget" # Internet file retriever -- https://www.gnu.org/software/wget/
brew "xz" # General-purpose data compression with high compression ratio -- https://tukaani.org/xz/
brew "yazi" # Blazing fast terminal file manager written in Rust, based on async I/O -- https://github.com/sxyazi/yazi
brew "yt-dlp" # Feature-rich command-line audio/video downloader -- https://github.com/yt-dlp/yt-dlp
brew "zellij" # Pluggable terminal workspace, with terminal multiplexer as the base feature -- https://zellij.dev
brew "zlib" # General-purpose lossless data-compression library -- https://zlib.net/
brew "zstd" # Zstandard is a real-time compression algorithm -- https://facebook.github.io/zstd/
# Dev casks
cask "android-studio" # Tools for building Android applications -- https://developer.android.com/studio/
cask "wine-stable" # Compatibility layer to run Windows applications -- https://wiki.winehq.org/MacOS

# Game dev apps
brew "sdl2"
brew "sdl2_image"
brew "sdl2_mixer"
brew "sdl2_ttf"
# Game dev casks
cask "blender" # 3D creation suite -- https://www.blender.org/
cask "defold" # Game engine for development of desktop, mobile and web games -- https://defold.com/
cask "godot" # Game development engine -- https://godotengine.org/
#cask "ldtk" # 2D level editor -- https://ldtk.io
cask "love" # 2D game framework for Lua -- https://love2d.org/
cask "magicavoxel" # 8-bit 3D voxel editor and interactive path tracing renderer -- https://ephtracy.github.io/
cask "tic80" # Fantasy computer for making, playing and sharing tiny games -- https://tic80.com/
cask "tiled" # Flexible level editor -- https://www.mapeditor.org/
