{
  "$schema": "https://aka.ms/winget-packages.schema.2.0.json",
  "CreationDate": "2025-03-22T23:36:24.933-00:00",
  "Sources": [
    {
      "Packages": [
        {
          "PackageIdentifier": "ajeetdsouza.zoxide"
        },
        {
          "PackageIdentifier": "Audacity.Audacity"
        },
        {
          "PackageIdentifier": "AutoHotkey.AutoHotkey"
        },
        {
          "PackageIdentifier": "Bitwarden.Bitwarden"
        },
        {
          "PackageIdentifier": "BlenderFoundation.Blender"
        },
        {
          "PackageIdentifier": "Brave.Brave"
        },
        {
          "PackageIdentifier": "BurntSushi.ripgrep.MSVC"
        },
        {
          "PackageIdentifier": "CPUID.CPU-Z"
        },
        {
          "PackageIdentifier": "DigitalScholar.Zotero"
        },
        {
          "PackageIdentifier": "Docker.DockerDesktop"
        },
        {
          "PackageIdentifier": "EpicGames.EpicGamesLauncher"
        },
        {
          "PackageIdentifier": "Fastfetch-cli.Fastfetch"
        },
        {
          "PackageIdentifier": "Git.Git"
        },
        {
          "PackageIdentifier": "GNU.Emacs"
        },
        {
          "PackageIdentifier": "GodotEngine.GodotEngine"
        },
        {
          "PackageIdentifier": "Gyan.FFmpeg"
        },
        {
          "PackageIdentifier": "Helix.Helix"
        },
        {
          "PackageIdentifier": "jdx.mise"
        },
        {
          "PackageIdentifier": "Jellyfin.JellyfinMediaPlayer"
        },
        {
          "PackageIdentifier": "junegunn.fzf"
        },
        {
          "PackageIdentifier": "KDE.Krita"
        },
        {
          "PackageIdentifier": "Kitware.CMake"
        },
        {
          "PackageIdentifier": "lsd-rs.lsd"
        },
        {
          "PackageIdentifier": "Microsoft.PowerShell"
        },
        {
          "PackageIdentifier": "Microsoft.PowerToys"
        },
        {
          "PackageIdentifier": "Microsoft.Sysinternals.Autoruns"
        },
        {
          "PackageIdentifier": "Microsoft.Sysinternals.ProcessMonitor"
        },
        {
          "PackageIdentifier": "Microsoft.Sysinternals.TCPView"
        },
        {
          "PackageIdentifier": "Microsoft.VisualStudioCode"
        },
        {
          "PackageIdentifier": "namazso.OpenHashTab"
        },
        {
          "PackageIdentifier": "Neovim.Neovim"
        },
        {
          "PackageIdentifier": "OBSProject.OBSStudio"
        },
        {
          "PackageIdentifier": "PeterPawlowski.foobar2000"
        },
        {
          "PackageIdentifier": "Proton.ProtonPass"
        },
        {
          "PackageIdentifier": "Proton.ProtonVPN"
        },
        {
          "PackageIdentifier": "qBittorrent.qBittorrent"
        },
        {
          "PackageIdentifier": "Rufus.Rufus"
        },
        {
          "PackageIdentifier": "sharkdp.bat"
        },
        {
          "PackageIdentifier": "sharkdp.fd"
        },
        {
          "PackageIdentifier": "sharkdp.hyperfine"
        },
        {
          "PackageIdentifier": "Starship.Starship"
        },
        {
          "PackageIdentifier": "sxyazi.yazi"
        },
        {
          "PackageIdentifier": "TechPowerUp.GPU-Z"
        },
        {
          "PackageIdentifier": "Valve.Steam"
        },
        {
          "PackageIdentifier": "VideoLAN.VLC"
        },
        {
          "PackageIdentifier": "vim.vim"
        },
        {
          "PackageIdentifier": "wez.wezterm"
        },
        {
          "PackageIdentifier": "yt-dlp.yt-dlp"
        },
        {
          "PackageIdentifier": "zig.zig"
        }
      ],
      "SourceDetails": {
        "Argument": "https://cdn.winget.microsoft.com/cache",
        "Identifier": "Microsoft.Winget.Source_8wekyb3d8bbwe",
        "Name": "winget",
        "Type": "Microsoft.PreIndexed.Package"
      }
    }
  ],
  "WinGetVersion": "1.10.340"
}
